{
  "home": {
    "greeting": "Ariel Nogueroles",
    "role": "Programador & Estudiante de Ciberseguridad",
    "bio": "Soy Ariel Nogueroles, un desarrollador de software con una profunda pasión por la creación de soluciones tecnológicas y una creciente especialización en ciberseguridad. Mi trayectoria, forjada en el exigente mundo de la metalurgia, me ha dotado de una disciplina inquebrantable, una atención meticulosa al detalle y una capacidad innata para la resolución de problemas complejos. Estas cualidades, ahora plenamente volcadas al código, me permiten abordar cada proyecto de programación con una precisión ingenieril y una dedicación incansable, transformando desafíos en algoritmos eficientes y sistemas robustos. Mi objetivo es construir el futuro digital, línea a línea, con la misma solidez y fiabilidad que se exige en la ingeniería de materiales.",
    "projects_button": "Mis Proyectos",
    "cv_button": "Descargar CV"
  },
  "about": {
    "title": "Sobre Mí",
    "paragraph1": "Mi trayectoria profesional comenzó en un ámbito muy diferente al de la tecnología. Serví en el ejército, donde desarrollé una fuerte disciplina y un gran sentido de la responsabilidad. Posteriormente, trabajé en la industria de la metalurgia, un sector que me enseñó la importancia de la precisión y la atención al detalle.",
    "paragraph2": "Sin embargo, mi verdadera pasión siempre fue la tecnología. Decidí dar un giro a mi carrera y me adentré en el mundo de la programación y la ciberseguridad. Hoy, aplico la misma dedicación y rigor que aprendí en mis anteriores experiencias para construir software de calidad y proteger sistemas.",
    "interests": "Intereses",
    "interest1": "Desarrollo Web",
    "interest2": "Backend",
    "interest3": "Ciberseguridad",
    "certificates": "Certificados"
  },
  "skills": {
    "title": "Habilidades Técnicas",
    "languages": "Lenguajes",
    "frameworks": "Frameworks y Librerías",
    "tools": "Herramientas"
  },
  "projects": {
    "title": "Proyectos"
  },
  "blog": {
    "title": "Blog"
  },
  "certificates": {
    "title": "Certificados"
  },
  "contact": {
    "title": "Contacto",
    "form_title": "Envíame un mensaje",
    "name": "Nombre",
    "name_required": "El nombre es requerido",
    "email": "Email",
    "email_required": "El email es requerido",
    "email_invalid": "Introduce un email válido",
    "message": "Mensaje",
    "message_required": "El mensaje es requerido",
    "send": "Enviar Mensaje",
    "other_contact": "Otras formas de contactar"
  },
  "header": {
    "home": "Home",
    "about": "Sobre Mí",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "blog": "Blog",
    "certificates": "Certificados",
    "contact": "Contacto"
  }
}
